Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: However, if you don't want to receive all the messages sent to a mailing list, you can set your subscription to "no email". You will still be a subscriber able to send messages, but you won't receive any e-mail. If people reply to your message, their e-mail clients will default to including your email address in the conversation anyway.
it_it: Tuttavia, se non si desidera ricevere tutti i messaggi inviati a una mailing list, si può impostare l'iscrizione su "no email". Si rimarrà comunque iscritti e si potranno inviare messaggi, ma non si riceveranno email. Se qualcuno risponde al messaggio, il suo client di posta elettronica includerà automaticamente il proprio indirizzo email nella conversazione.

source: However, the "Local Yocto Project" release will not provide you with any compatible layers, other than the three core layers that come with the Yocto Project:
it_it: Tuttavia, la versione "Local Yocto Project" non include layer compatibili, ad eccezione dei tre layer principali forniti con Yocto Project:

source: However, we already have an image with the binaries stripped, so what can we do to get perf to resolve the symbols? Basically we need to install the debugging information for the BusyBox package.
it_it: Tuttavia, abbiamo già un'immagine con i binari rimossi, quindi cosa possiamo fare per far sì che perf risolva i simboli? Fondamentalmente, dobbiamo installare le informazioni di debug per il pacchetto BusyBox.

source: However, you should realize that stamp files only serve as a marker that some work has been done and that these files do not record task output. The actual task output would usually be somewhere in :term:`TMPDIR` (e.g. in some recipe's :term:`WORKDIR`.) What the sstate cache mechanism adds is a way to cache task output that can then be shared between build machines.
it_it: Tuttavia, è importante notare che i file di stamp servono solo come indicatore dell'avvenuta esecuzione di un task e non registrano l'output del task stess. L'output effettivo del task si trova solitamente in :term:`TMPDIR` (ad esempio, nella :term:`WORKDIR` di alcune ricette). Il meccanismo di cache sstate aggiunge un modo per memorizzare nella cache l'output dei task, che può quindi essere condiviso tra le macchine di compilazione.

source: Identifying the component
it_it: Identificazione del Componente

source: If :ref:`ref-tasks-deploy` is not already in the shared state cache or if its input checksum (signature) has changed from when the output was cached, the task runs to populate the shared state cache, after which the contents of the shared state cache is copied to ${:term:`DEPLOY_DIR_IMAGE`}. If :ref:`ref-tasks-deploy` is in the shared state cache and its signature indicates that the cached output is still valid (i.e. if no relevant task inputs have changed), then the contents of the shared state cache copies directly to ${:term:`DEPLOY_DIR_IMAGE`} by the ``do_deploy_setscene`` task instead, skipping the :ref:`ref-tasks-deploy` task.
it_it: Se :ref:`ref-tasks-deploy` non è già presente nella cache di "shared state" [stato condivisa] o se il suo checksum (firma) di input è cambiato rispetto a quando l'output è stato memorizzato nella cache, il task viene eseguito per popolare la cache di shared state, dopodiché il contenuto della cache di shared state viene copiato in ${:term:`DEPLOY_DIR_IMAGE`}. Se :ref:`ref-tasks-deploy` è presente nella cache di shared state e la sua firma indica che l'output memorizzato nella cache è ancora valido (ovvero, se nessun input rilevante del task è cambiato), il contenuto della cache di shared state viene copiato direttamente in ${:term:`DEPLOY_DIR_IMAGE`} dal task ``do_deploy_setscene``, saltando il task :ref:`ref-tasks-deploy`.

source: If :term:`ALTERNATIVE_LINK_NAME` and :term:`ALTERNATIVE_TARGET` are the same, the target for :term:`ALTERNATIVE_TARGET` has "``.{BPN}``" appended to it.
it_it: Se :term:`ALTERNATIVE_LINK_NAME` e :term:`ALTERNATIVE_TARGET` sono uguali, al target di :term:`ALTERNATIVE_TARGET` viene aggiunto "``.{BPN}``".

source: If :term:`ALTERNATIVE_LINK_NAME` is not defined, it defaults to ``${bindir}/name``.
it_it: Se :term:`ALTERNATIVE_LINK_NAME` non è definito, il valore di default è``${bindir}/name``.

source: If :term:`ALTERNATIVE_TARGET` is not defined, it inherits the value from the :term:`ALTERNATIVE_LINK_NAME` variable.
it_it: Se :term:`ALTERNATIVE_TARGET` non è definita, eredita il valore dalla variabile :term:`ALTERNATIVE_LINK_NAME`.

source: If :term:`PV` changes in such a way that it does not increase with respect to the previous value, you need to increase :term:`PE` to ensure package managers will upgrade it correctly. If unset you should set :term:`PE` to "1" since the default of empty is easily confused with "0" depending on the package manager. :term:`PE` can only have an integer value.
it_it: Se :term:`PV` cambia in modo tale da non aumentare rispetto al valore precedente, è necessario incrementare :term:`PE` per garantire che i gestori di pacchetti lo aggiornino correttamente. Se non è impostato, è consigliabile impostare :term:`PE` a "1" poiché il valore predefinito vuoto può essere facilmente confuso con "0" a seconda del gestore di pacchetti. :term:`PE` può assumere solo un valore intero.

source: If Toaster can reach the API URL, you should see a message telling you that Toaster is updating the layer source information.
it_it: Se Toaster riesce a raggiungere l'URL dell'API, verrà visualizzato un messaggio che informa che Toaster sta aggiornando le informazioni della sorgente dei layer.

source: If a BSP does not have a formfactor entry, defaults are established according to the formfactor configuration file that is installed by the main formfactor recipe ``meta/recipes-bsp/formfactor/formfactor_0.0.bb``, which is found in :term:`OpenEmbedded-Core (OE-Core)`.
it_it: Se un BSP non ha una voce per il fattore di forma, vengono impostati i valori di default in base al file di configurazione del fattore di forma installato dalla ricetta principale del fattore di forma ``meta/recipes-bsp/formfactor/formfactor_0.0.bb``, che si trova in :term:`OpenEmbedded-Core (OE-Core)`.

source: If a file named ``defconfig`` is included in the :term:`SRC_URI`, it will be copied to ``.config`` in the build directory and used as the barebox configuration. Instead of providing a ``defconfig`` file, you can set :term:`BAREBOX_CONFIG` to a defconfig provided by the barebox source tree. If neither ``defconfig`` nor :term:`BAREBOX_CONFIG` is specified, the class will raise an error.
it_it: Se un file denominato ``defconfig`` è incluso in :term:`SRC_URI`, verrà copiato in ``.config`` nella directory di build e utilizzato come configurazione barebox. Invece di fornire un file ``defconfig``, è possibile impostare :term:`BAREBOX_CONFIG` con un file defconfig fornito dall'albero dei sorgenti di barebox. Se non vengono specificati né ``defconfig`` né :term:`BAREBOX_CONFIG`, la classe genererà un errore.

source: If a module requires a license that is not in the base list, the build process generates a warning during the build. These tools make it easier for a developer to be certain of the licenses with which their shipped products must comply. However, even with these tools it is still up to the developer to resolve potential licensing issues.
it_it: Se un modulo richiede una licenza non presente nell'elenco di base, il processo di compilazione genera un warning durante la compilazione. Questi strumenti facilitano agli sviluppatori la verifica delle licenze a cui i loro prodotti distribuiti devono essere conformi. Tuttavia, anche con questi strumenti, spetta comunque allo sviluppatore risolvere eventuali problemi di licenza.

source: If an upstream project does not fix the problem in a reasonable time, the Yocto's Security Team will contact other interested parties (usually other distributions) in the community and together try to solve the vulnerability as quickly as possible.
it_it: Se un progetto upstream non risolve il problema entro un tempo ragionevole, il Security Team di Yocto contatterà altre parti interessate (di solito altre distribuzioni) nella community e cercherà insieme di risolvere la vulnerabilità il più rapidamente possibile.

source: If an upstream project does not respond quickly
it_it: Se un progetto upstream non risponde tempestivamente

source: If analysis shows that the CVE issue does not impact the recipe due to configuration, platform, version or other reasons, the CVE can be marked as ``Ignored`` by using the :term:`CVE_STATUS` variable flag with appropriate reason which is mapped to ``Ignored``. The entry should have the format like::
it_it: Se l'analisi mostra che il problema CVE non ha un impatto sulla ricetta a causa della configurazione, della piattaforma, della versione o di altri motivi, il CVE può essere contrassegnato come ``Ignored`` utilizzando il flag della variabile :term:`CVE_STATUS` con il motivo appropriato, che viene mappato a ``Ignored``. La voce dovrebbe avere il seguente formato::

source: If any pre-existing copyrighted materials (including pre-existing open source code) authored or owned by third parties are included in the AI tool's output, prior to contributing such output to the project, the Contributor should confirm that they have permission from the third party owners -- such as the form of an open source license or public domain declaration that complies with the project's licensing policies -- to use and modify such pre-existing materials and contribute them to the project. Additionally, the contributor should provide notice and attribution of such third party rights, along with information about the applicable license terms, with their contribution.
it_it: Qualora l'output dello strumento di intelligenza artificiale includa materiale protetto da copyright preesistente (incluso codice open source preesistente) di proprietà o creato da terzi, prima di contribuire al progetto, il Contributore deve accertarsi di aver ottenuto l'autorizzazione dai proprietari terzi – ad esempio tramite una licenza open source o una dichiarazione di pubblico dominio conforme alle politiche di licenza del progetto – per utilizzare e modificare tale materiale preesistente e contribuire al progetto. Inoltre, il Contributore deve fornire, insieme al proprio contributo, una notifica e l'attribuzione di tali diritti di terzi, unitamente alle informazioni sui termini di licenza applicabili.

source: If applicable, ensure also the ``native`` and ``nativesdk`` variants builds
it_it: Se applicabile, eseguire anche le build delle varianti ``native`` e ``nativesdk``

source: If everything worked as planned, you should see something like this (enter the password when prompted, or press enter if it's set up to use no password):
it_it: Se tutto ha funzionato come previsto, si dovrebbe visualizzare qualcosa di simile a questo (inserire la password quando richiesto o premere Invio se è configurato per non richiedere password):

source: If however, a non-encumbered version is unavailable or it provides unsuitable functionality or quality, you can use an encumbered version.
it_it: Se, tuttavia, non è disponibile una versione libera o se questa offre funzionalità o qualità inadeguate, è possibile utilizzare una versione con licenza.

source: If in doubt, please ask on the :yocto_lists:`yocto </g/yocto/>` general mailing list or on the :oe_lists:`openembedded-devel </g/openembedded-devel>` mailing list.
it_it: In caso di dubbi, si prega di chiedere sulla mailing list generale :yocto_lists:`yocto </g/yocto/>` o sulla mailing list :oe_lists:`openembedded-devel </g/openembedded-devel>`.

source: If necessary, rework your commits as described in ":ref:`contributor-guide/submit-changes:taking patch review into account`".
it_it: Se necessario, rielaborare i propri commit come descritto in ":ref:`contributor-guide/submit-changes:taking patch review into account`".

source: If objects are found in the sstate cache, the build system works backwards from the end targets specified by the user. For example, if an image is being built, the build system first looks for the packages needed for that image and the tools needed to construct an image. If those are available, the compiler is not needed. Thus, the compiler is not even downloaded. If something was found to be unavailable, or the download or setscene task fails, the build system then tries to install dependencies, such as the compiler, from the cache.
it_it: Se gli oggetti vengono trovati nella cache di sstate, il sistema di build procede a ritroso a partire dai target finali specificati dall'utente. Ad esempio, se si sta compilando un'immagine, il sistema di compilazione cerca prima i pacchetti necessari per quell'immagine e gli strumenti necessari per crearla. Se questi sono disponibili, il compilatore non è necessario. Pertanto, il compilatore non viene nemmeno scaricato. Se un elemento risulta non disponibile, oppure se il download o il task di impostazione della scena falliscono, il sistema di build tenta di installare le dipendenze, come il compilatore, dalla cache.

source: If other people participated in this patch, add some tags to the commit description to credit other contributors to the change:
it_it: Se altre persone hanno partecipato a questa patch, aggiungere alcuni tag alla descrizione del commit per dare credito agli altri contributori alla modifica:

source: If people have concerns with any of the patches, they will usually voice their concern over the mailing list. If patches do not receive any negative reviews, the maintainer of the affected layer typically takes them, tests them, and then based on successful testing, merges them.
it_it: Se qualcuno ha dubbi su una qualsiasi delle patch, di solito li esprime tramite la mailing list. Se le patch non ricevono recensioni negative, il manutentore del layer interessato in genere le prende, le testa e, in base all'esito positivo dei test, le integra.

source: If the BSP's ``binary`` directory is missing or the directory has no images, an existing ``README.sources`` file is meaningless and usually does not exist.
it_it: Se la directory ``binary`` del BSP non esiste o non contiene immagini, un file ``README.sources`` esistente è inutile e di solito non esiste.

source: If the ``meta-xyz`` layer did not support multiple machines, you would place the interfaces configuration file in the layer here::
it_it: Se il layer ``meta-xyz`` non supportasse più macchine, si deve posizionare il file di configurazione delle interfacce nel layer qui::

source: If the ``orm/fixtures/custom.xml`` file exists, then its values are added.
it_it: Se il file ``orm/fixtures/custom.xml`` esiste, i suoi valori vengono aggiunti.

source: If the change addresses a specific bug or issue that is associated with a bug-tracking ID, include a reference to that ID in the body of the commit message. For example, the Yocto Project uses a specific convention for bug references --- any commit that addresses a specific bug should use the following form for the body of the commit message. Be sure to use the actual bug-tracking ID from Bugzilla for bug-id::
it_it: Se la modifica risolve un bug o un problema specifico associato a un ID di tracciamento dei bug, includere un riferimento a tale ID nel corpo del messaggio di commit. Ad esempio, Yocto Project utilizza una convenzione specifica per i riferimenti ai bug: qualsiasi commit che risolve un bug specifico dovrebbe utilizzare il seguente formato per il corpo del messaggio di commit. Assicurarsi di utilizzare l'ID di tracciamento del bug effettivo di Bugzilla per bug-id::

source: If the issue is confirmed and affects an upstream project, the YP security team notifies the project. Usually, the upstream project analyzes the problem again. If they deem it a real security problem in their software, they develop and release a fix following their security policy. They may want to include the original reporter in the loop. There is also sometimes some coordination for handling patches, backporting patches etc, or just understanding the problem or what caused it.
it_it: Se il problema viene confermato e riguarda un progetto upstream, il team di sicurezza YP informa il progetto. Di solito, il progetto upstream analizza nuovamente il problema. Se lo ritiene un vero problema di sicurezza nel proprio software, sviluppa e rilascia una soluzione seguendo la propria politica di sicurezza. Potrebbe voler coinvolgere anche il segnalatore originale. A volte è necessario coordinarsi per la gestione delle patch, il backporting delle patch, ecc., o semplicemente per comprendere il problema o le sue cause.

source: If the issue is confirmed and affects the code maintained by the YP, they confidentially notify maintainers of that code and work with them to prepare a fix.
it_it: Se il problema viene confermato e riguarda il codice gestito da YP, il team di sicurezza informa in via confidenziale i manutentori di tale codice e collabora con loro per preparare una soluzione.

source: If the issue is in the core metadata layer (OpenEmbedded-Core) or in BitBake, issues can be reported in the :yocto_bugs:`Yocto Project Bugzilla <>`. The :yocto_lists:`yocto </g/yocto>` mailing list is a general "catch-all" location where questions can be sent if you can't work out where something should go.
it_it: Se il problema si trova nel livello dei metadati principali (OpenEmbedded-Core) o in BitBake, è possibile segnalarlo nel :yocto_bugs:`Yocto Project Bugzilla <>`. La mailing list :yocto_lists:`yocto </g/yocto>` è un punto di riferimento generico dove è possibile inviare domande se non si riesce a capire dove indirizzarle.

source: If the mailing list requires a subject prefix for the layer (this only works when the repository only contains one layer)::
it_it: Se la mailing list richiede un prefisso per l'oggetto del layer (questo funziona solo se il repository contiene un solo layer)::

source: If the output hash is already known, BitBake will update the task's unihash to match the original task hash that generated that output. Thanks to this, the depending tasks will keep a previously recorded task hash, and BitBake will be able to retrieve their output from the Shared State cache, instead of re-executing them. Similarly, the output of further downstream tasks can also be retrieved from Shared State.
it_it: Se l'hash di output è già noto, BitBake aggiornerà l'unihash del task in modo che corrisponda all'hash del task originale che ha generato quell'output. In questo modo, i task dipendenti manterranno l'hash precedentemente registrato e BitBake sarà in grado di recuperare il loro output dalla cache dello Shared State, anziché rieseguirle. Analogamente, anche l'output dei task successive può essere recuperato dallo Shared State.

source: If the output hash is unknown, a new entry will be created on the Hash Equivalence server, matching the task hash to that output. The depending tasks, still having a new task hash because of the change, will need to re-execute as expected. The change propagates to the depending tasks.
it_it: Se l'hash di output non è noto, verrà creata una nuova voce sul server di Hash Equivalence, associando l'hash del task a quell'output. I task dipendenti, che avranno ancora un nuovo hash a causa della modifica, dovranno essere rieseguiti come previsto. La modifica si propaga ai task dipendenti.

source: If the recipe is tracking a Git revision that does not correspond to a released version of the software, ``version`` may be ``git`` (e.g. ``recipename_git.bb``) and the recipe would set :term:`PV`.
it_it: Se la ricetta fa riferimento a una revisione Git che non corrisponde a una versione rilasciata del software, ``version`` può essere ``git`` (ad esempio, ``recipename_git.bb``) e la ricetta imposterà :term:`PV`.

source: If the single line summary is enough to describe a simple change, the commit description can be left empty.
it_it: Se il riepilogo di una sola riga è sufficiente a descrivere una modifica semplice, la descrizione del commit può essere lasciata vuota.

source: If the software being built by a recipe does not support using out-of-tree builds, you should have the recipe inherit the :ref:`autotools-brokensep <ref-classes-autotools>` class. The :ref:`autotools-brokensep <ref-classes-autotools>` class behaves the same as the :ref:`ref-classes-autotools` class but builds with :term:`B` == :term:`S`. This method is useful when out-of-tree build support is either not present or is broken.
it_it: Se il software compilato da una ricetta non supporta l'utilizzo di build out-of-tree, è necessario che la ricetta erediti la classe :ref:`autotools-brokensep <ref-classes-autotools>`. La classe :ref:`autotools-brokensep <ref-classes-autotools>` si comporta allo stesso modo della classe :ref:`ref-classes-autotools`, ma compila con :term:`B` == :term:`S`. Questo metodo è utile quando il supporto per le build out-of-tree non è presente o è difettoso.

source: If this is not the case, you can reconfigure the ``locales`` package to add it (requires an interactive shell)::
it_it: In caso contrario, è possibile riconfigurare il pacchetto ``locales`` per aggiungerla (richiede una shell interattiva)::

source: If we expand one of the entries and press ``Enter`` on a leaf node, we're presented with a menu of actions we can take to get more information related to that entry:
it_it: Se espandiamo una delle voci e premiamo ``Enter`` su un nodo foglia, ci viene mostrato un menu di azioni che possiamo intraprendere per ottenere maggiori informazioni relative a quella voce:

source: If you add your own task that manipulates the same files or directories as a fakeroot task, then that task also needs to run under fakeroot. Otherwise, the task cannot run root-only operations, and cannot see the fake file ownership and permissions set by the other task. You need to also add a dependency on ``virtual/fakeroot-native:do_populate_sysroot``, giving the following::
it_it: Se si aggiunge un proprio task che manipola gli stessi file o directory di un task fakeroot, anche tale task deve essere eseguito con i permessi di root. In caso contrario, il task non può eseguire operazioni che richiedono solo i permessi di root e non può visualizzare la proprietà e i permessi fittizi dei file impostati dall'altro task. È inoltre necessario aggiungere una dipendenza da ``virtual/fakeroot-native:do_populate_sysroot``, specificando quanto segue::

source: If you are dealing with a not-yet-released issue, or an urgent one, please send a message to security AT yoctoproject DOT org, including as many details as possible: the layer or software module affected, the recipe and its version, and any example code, if available. This mailing list is monitored by the Yocto Project Security team.
it_it: Se si riscontra un problema non ancora rilasciato o se si tratta di un problema urgente, inviare un messaggio security AT yoctoproject DOT org, includendo il maggior numero possibile di dettagli: il layer o il modulo software interessato, la ricetta e la sua versione, ed eventuali esempi di codice, se disponibili. Questa mailing list è monitorata dal team di Yocto Project Security.

source: If you are familiar with this type of development environment, you might not want to read this section.
it_it: Se si ha già familiarità con questo tipo di ambiente di sviluppo, si può saltare questa sezione.

source: If you are interested in providing resources for improving testing please contact the :yocto_wiki:`Technical Steering Committee (TSC) </TSC>`.
it_it: Se si è interessati a fornire risorse per migliorare i test, contattare il :yocto_wiki:`Technical Steering Committee (TSC) </TSC>`.
